const subjects = {
	'OOS': 'Основы операционных систем',
	'OP': 'Основы прогроммирования',
	'English': 'Английский язык 2',
	'Russian': 'Русский язык 2',
	'History': 'Современная история Казахстана',
	'Practice': 'Учебная практика',
	'PE': 'Физическая культура 2',
	'none': '',
	'BN': 'Бағдарламалау негіздері',
	'OOSLek': 'Основы операционных систем',
	'OPLek': 'Основы прогроммирования',
};

const prepods = {
	'OOS': 'Адилова Акнур',
	'OP': 'Адилова Акнур',
	'English': 'Бапанов Арман Ауданбекович',
	'Russian': 'Жаманбаева Асель Сайлаубековна',
	'History': 'Кобесова Акнур Смаиловна',
	'Practice': 'Боранкулова Гаухар Сарсенбаевна',
	'PE': 'Бекбергенова Жанар Ешеналиевна',
	'none': '',
	'BN': 'Абдувалова Айнур Джумабаевна',
	'OOSLek': 'Абдыкеримова Ляззат Алтынбековна',
	'OPLek': 'Абдувалова Айнур Джумабаевна',
};

if (studentName === 'Тлеумбетова Зарина' || studentName === 'Орынтай Нұржігіт') {
	prepods.History = 'Алпысбаева Ғалия Бақытқызы';
	prepods.PE = 'Аязбеков Бейбіт Барзыуұлы';
} else if (studentName === 'Жанысбаева Жанел') {
	prepods.English = 'Кенжемуратова Сауле Алматқызы';
	prepods.History = 'Альдибаева Аида Берікқызы';
	prepods.PE = 'Аязбеков Бейбіт Барзыуұлы';
} else if (studentName === 'Шермағанбет Іңкәр') {
	prepods.History = 'Алпысбаева Ғалия Бақытқызы';
} else if (studentName === 'Байгабеков Жекебай') {
	prepods.English = 'Казбекова Шолпан Ислямхановна';
	prepods.History = 'Тобаджанов Рахат Тобаджанович';
} else if (studentName === 'Сағынбек Диас') {
	prepods.PE = 'Аязбеков Бейбіт Барзыуұлы';
} else if (studentName === 'Аппаз Елдос') {
	prepods.English = 'Кенжемуратова Сауле Алматқызы';
	prepods.Russian = 'Малдыбаева Ботагөз Амангалиевна';
	prepods.History = 'Ермаханова Рая Бейсенәліқызы'
	prepods.PE = 'Омаров Құрманғазы Жолдыбайұлы';
} else if (studentName === 'Әмір Саламат' || studentName === 'Мырзатай Ермек') {
	prepods.History = 'Бейсембекова Гүлбағира Жарқынбекқызы';
} else if (studentName === 'Қалдыбек Саят') {
	prepods.English = 'Кенжемуратова Сауле Алматқызы';
	prepods.Russian = 'Малдыбаева Ботагөз Амангалиевна';
	prepods.History = 'Тобаджанов Рахат Тобаджанович';
	prepods.PE = 'Аязбеков Бейбіт Барзыуұлы';
}