const subjects = {
	'OOS': 'Основы операционных систем',
	'OP': 'Основы прогроммирования',
	'English': 'Английский язык 2',
	'Russian': 'Русский язык 2',
	'History': 'Современная история Казахстана',
	'Practice': 'Учебная практика',
	'PE': 'Физическая культура 2',
	'none': '',
	'BN': 'Бағдарламалау негіздері',
	'OOSLek': 'Основы операционных систем',
	'OPLek': 'Основы прогроммирования',
};

const prepods = {
	'OOS': 'Адилова Акнур',
	'OP': 'Адилова Акнур',
	'English': 'Бапанов Арман Ауданбекович',
	'Russian': 'Жаманбаева Асель Сайлаубековна',
	'History': 'Алпысбаева Ғалия Бақытқызы',
	'Practice': 'Боранкулова Гаухар Сарсенбаевна',
	'PE': 'Аязбеков Бейбіт Барзыуұлы',
	'none': '',
	'BN': 'Абдувалова Айнур Джумабаевна',
	'OOSLek': 'Абдыкеримова Ляззат Алтынбековна',
	'OPLek': 'Абдувалова Айнур Джумабаевна',
};